//=====================================================================
//
// Camera [Camera.cpp]
// Author : 
// 
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "Camera.h"
#include "input.h"


//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************
CAMERA g_camera;

//=====================================================================
// 初期化処理
//=====================================================================
void InitCamera(void)
{
	ZeroMemory(&g_camera, sizeof(CAMERA));
	g_camera.posV = D3DXVECTOR3(0, 50, -50);
	g_camera.posR = D3DXVECTOR3(0, 0, 0);
	g_camera.vecU = D3DXVECTOR3(0, 1, 0);
	g_camera.rot = D3DXVECTOR3(0, 0, 0);

	// プロジェクションマトリックスの初期化
	D3DXMatrixIdentity(&g_camera.mtxProjection);

	// プロジェクションマトリックスを作成（透視投影行列）
	D3DXMatrixPerspectiveFovLH(
		&g_camera.mtxProjection,
		D3DXToRadian(45.0f),							// 視野角
		(float)SCREEN_WIDTH / (float)SCREEN_HEIGHT,		// アスペクト比
		10.0f,											// 最小Z値
		1000.0f											// 最大Z値
	);
}

//=====================================================================
// 終了処理
//=====================================================================
void UninitCamera(void)
{

}

//=====================================================================
// 更新処理
//=====================================================================
void UpdateCamera(void)
{
	if (GetKeyboardPress(DIK_A))
	{
		g_camera.posV.x -= 1;
	}
	if (GetKeyboardPress(DIK_D))
	{
		g_camera.posV.x += 1;
	}
}

//=====================================================================
// カメラ設定処理
//=====================================================================
void SetCamera(void)
{
	LPDIRECT3DDEVICE9 pDevice = GetDevice();

	// プロジェクションマトリックスの設定
	pDevice->SetTransform(D3DTS_PROJECTION, &g_camera.mtxProjection);

	// ビューマトリックスの初期化
	D3DXMatrixIdentity(&g_camera.mtxView);

	// ビューマトリックスの作成
	D3DXMatrixLookAtLH(
		&g_camera.mtxView,
		&g_camera.posV,
		&g_camera.posR,
		&g_camera.vecU
	);

	// ビューマトリックスの設定
	pDevice->SetTransform(D3DTS_VIEW, &g_camera.mtxView);
}

CAMERA* GetCamera(void)
{
	return &g_camera;
}